Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་སྒྲ་གཅན་སྦེད་པ་ཚན་ཆེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་བློ་དེ་ནི། །ལམ་དུ་ཞུགས་ཚེ་བསིལ་བའི་རླུང་ཡབ་བྱས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhuguhya, when a champion, Offered cooling fanning To the thus-gone Mind of Love And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་རྒྱ་མཚོ་གྲོང་རྡལ་གྱི། །བྱིས་པའི་ཚེ་ན་བདེ་གཤེགས་བྱང་ཆུབ་འོད། །དེ་ལ་ཚེམས་ཤིང་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇasāgara, when a village boy, Offered toothsticks To the well-gone Light of Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ལྡན་པ་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ལ། །མར་མེའི་ཁ་ནི་སྟོང་སྙེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sahitaraśmi, when the son of a merchant, Offered thousands of lamps To the thus-gone Ocean And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་ཏུ་ཞི་སྟབས་གྱད་ཀྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་དགྱེས་དེ་ལ། །ནོར་བུས་སྤྲས་པའི་མཆིལ་ལྷམ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntagati, when an athlete, Offered jewel-studded footwear To the thus-gone Delighting in Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་བཟང་པོ་སྤོས་འཚོང་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཆེན་དེ་ལ་ཕྱེ་མ་ཡིས། །བཀང་བའི་ན་བཟའ་དང་ནི་པད་མ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokasundara, when the son of an incense merchant, Offered garments filled with fragrant powder along with lotus flowers To the thus-gone Great Deity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་མེད་པ་གོས་འཚོང་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་ནི་ཟབ་མོ་དེ་ལ་ཡང་། །རྫི་ཆར་བྱུང་བའི་ཚེ་ན་མེ་ཏོག་གདུགས་ཕུལ་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aśoka, when the son of a clothing merchant, Offered a flower umbrella during a rainstorm To the thus-gone Profound Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཤུགས་བཅུ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབང་ཕྱུག་ཅན། །ལམ་དུ་ཞུགས་ཚེ་གདན་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Daśavaśa, when a prince, Offered sitting mats To the thus-gone Lord of Dharma when he was traveling And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་དགྱེས་རོལ་མོ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཙོ་ཆེན་དེ་ལ་ནི། །དུང་སྒྲ་དག་ནི་བུད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Balanandin, when a musician, Offered conch tones To the thus-gone Great Leader And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་དཔལ་རོལ་མོའི་གླུ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་སེམས་དེ་ལས། །གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་མནོས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthāmaśrī, when a singer, Received the refuge vows From the thus-gone Intelligent Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཐོབ་མཉན་པའི་ཚེ། །ཆུ་བོ་དག་ལ་ཟམ་པ་བཙུགས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འོད་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthāmaprāpta, when a ferryman, Constructed a bridge across a river Before the thus-gone Light of Wisdom And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཆེན་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་འཁྲུལ་མེད་ལ། །ཁྲུས་རས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahāsthāman, when a bath attendant, Offered towels To the thus-gone Wisdom without Delusion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་སྙིང་པོ་ཚོང་དཔོན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་བསོད་ནམས་འཕགས་པ་ལ། །དྷ་ནུ་སྐ་རའི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇagarbha, when the son of a merchant, Offered dhānuṣkārin flowers To the well-gone Superior Merit And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་སྤྱོད་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནོར་ལྷའི་བུ་གྲགས་ལ། །སྤོས་ཀྱི་རི་ལུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyacara, when an incense merchant, Offered balls of incense To the thus-gone Renowned Son of the God of Wealth And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགེ་མཆོག་རྒྱལ་པོ་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་ཆེན་སངས་རྒྱས་དེ་ལ་སོགས། །དགེ་སློང་དག་གི་དགེ་འདུན་སྤྱན་ནི་དྲངས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kṣemottamarāja, when a king, Invited the thus-gone Buddha of Great Array Along with his saṅgha of monks, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐར་རྒྱལ་ཤིང་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་ལྡན་པ། །བདེ་གཤེགས་དེ་ལ་ཐལ་སྦྱར་ཕྱག་བྱས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Tiṣya, when a carpenter, Joined his palms in homage Before the blessed one, the thus-gone Endowed with Moonlight, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཆེན་པོ་ཚལ་གྱི་ལས། །བྱེད་ཚེ་བདེ་གཤེགས་ལྷ་ཡི་འོད་ཟེར་ལ། །ལྗོན་པའི་ཚོན་དག་སྦྱར་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāraśmi, when a gardener, Prepared and offered dyes made from trees Before the well-gone Divine Radiance And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གློག་འོད་རྫ་མཁན་ཚེ། །བདེ་གཤེགས་འོད་གསལ་དེ་ལ་ཟླ་བ་བཞིར། །བུམ་པ་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vidyutprabha, when a potter, Offered jars filled with water for four months To the well-gone Luminous And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་རྒྱ་ཆེན་ནད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་དགྱེས་དེ་ལ། །ལྕགས་ཀྱི་སྣོད་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇavisṛta, when a sick person, Offered iron vessels To the thus-gone Delighting in Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་པོ་ཆེ་ནི་ཚོང་དཔོན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་སེང་གེའི་བློ་གྲོས་ལ། །མུ་ཏིག་དག་གི་ཆུན་ཕྲེང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratna, when the son of a merchant, Offered a pearl garland To the well-gone Lion Intelligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་འོད་སྤོས་འཚོང་གི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་ས་གཙོ་ལ། །ཕྱེ་མས་བཀང་བའི་ཨུད་པལ་ན་བཟའ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śrīprabha, when the son of an incense merchant, Offered utpalas and garments suffused with fragrant powder To the thus-gone Foremost on This Earth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གོ་ཆ་བགོས་པ་ལྷའི་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་དེ་ལ། །བསྟོད་པ་དག་གིས་བསྟོད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kṛtavarman, when a divine son, Offered praises To the thus-gone Jewel Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་ཕྱག་ནི་ཚལ་གྱི་ལས། །བྱེད་ཚེ་བདེ་གཤེགས་འོད་ཟེར་བཟང་པོ་ལ། །མེ་ཏོག་དག་གི་ཕུར་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhahasta, when a garden worker, Offered vessels of flowers To the well-gone Excellent RadianceAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་བཟང་པོ་ཡིག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་གསུང་དེ་ལ། །གྲོ་བའི་གླེགས་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Supuṣpa, when a scribe, Offered birch bark scrolls To the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་མཐོན་པོ་ཤལ་ཁྱེར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྡུག་དེ་ལ། །མར་མེ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnottama, when a porter carrying plaster, Offered butter lamps To the thus-gone Lovely Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱ་མཚོ་རོལ་མོ་མཁན་གྱི་ཚེ། །རྔ་བོ་ཆེ་དག་བརྡུང་བ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་གདུགས་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sāgara, when a musician, Beat great drums Before the thus-gone Moon Parasol And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ས་འཛིན་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་དེ་ལ། །མཚོན་ཆ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharaṇīdhara, when a blacksmith, Offered weapons To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་བློ་ལྷའི་བུ་ཉི་མའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གོས་པ་མེད་དེ་ལ། །མེ་ཏོག་མན་ད་ར་བ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arthabuddhi, when a divine son by the name of Sun, Scattered mandārava flowers Before the thus-gone Immaculate And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་བསགས་པ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་བླ་བཞུད་པ་ན། །འདམ་རྫབ་དག་ཏུ་རྡོ་ལེབ་ཟམ་བཙུགས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇagaṇa, when a physician, Built a bridge of flat stones across a swamp Before the thus-gone Movement of Highest Renown And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་ཚོགས་ནི་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཞལ་དེ་ལ། །སྐྱུ་རུ་ར་ཡི་འབྲས་བུ་གཅིག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇagaṇa, when a physician, Offered a myrobalan fruit To the thus-gone Moon Face And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་མེ་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀླུ་ཡི་ལྷ་དེ་ལ། །བཻ་དཱུརྱའི་སྣོད་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnāgni, when a captain, Offered a beryl vessel filled with water To the thus-gone God of Nāgas And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་འདས་པ་ཚོང་འདུས་པ། །བྱེད་ཚེ་དགེ་འདུན་དག་ལ་འོད་སྒྲོན་ཕུལ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕུང་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokāntara, when a market merchant, Offered shining lamps to the saṅgha Before the thus-gone Heap of Qualities, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་ཟླ་བ་འཁོར་སྒྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བློ་དེ་ལ། །གཙུག་ལག་ཁང་ནི་སྟོང་སྙེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokacandra, when a universal monarch, Offered one thousand monastic temples To the thus-gone Mind of Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་རྒྱལ་པོ་བྲམ་ཟེའི་ཚེ། །ཕྱོགས་བཞིའི་དགེ་འདུན་དག་གི་བསམ་གཏན་ཁང་བརྩིགས་ནས། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་མཆོག་མ་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Madhura­svara­rāja, when a brahmin, Built meditation cabins for the members of the saṅgha in the four directions Before the thus-gone Supreme Flower, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་ཏོག་བྲམ་ཟེའི་བུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དགའ་དེ་ལ། །ཀུ་ཤའི་ན་བཟའ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmaketu, when the son of a brahmin, Offered clothing made of kuśa grass To the thus-gone Joy for the World And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་གཙོ་བོ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དཔག་མེད་ལ། །རིལ་བ་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇimukha, when a brahmin, Offered a pot filled with water To the thus-gone Immeasurable Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་སྟབས་གླིང་གཅིག་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པའི་ཏོག་དེ་ལ། །རས་བཅོས་གདིང་བ་དཔག་ཚད་གཅིག་པ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhagati, when the king of one continent, Offered fine cotton and carpets one league large To the thus-gone Truth Crest And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲག་ཤུལ་བྱིན་ནི་ཚོང་དཔོན་གྱི། །ཆུང་མའི་ཚེ་ན་བདེ་གཤེགས་ཉི་འོད་ལ། །ཕྱེ་མ་སྤར་གང་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ugradatta, when the wife of a merchant, Sprinkled handfuls of fragrant powder Before the well-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་དབང་ཕྱུག་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་དེ་ལ། །མེ་ཏོག་ཆལ་པར་བཀྲམ་པ་ཀུན་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmeśvara, when a garland maker, Spread out a blanket of flowers as an offering Before the thus-gone Nectar Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་འོད་ནི་ལྷའི་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པར་དགྱེས་པ་པོ། །བྱང་ཆུབ་སྙིང་པོར་བཞུགས་ལ་རྩྭ་གདན་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Tejasprabha, when a divine son, Offered a straw mat To the thus-gone Delighting in Teaching, who was residing upon his seat of awakening, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཆེན་པོ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསང་བར་དགྱེས་དེ་ལ། །རས་བཅོས་བྱེ་བ་སྙེད་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāraśmi, when a householder, Offered tens of millions of fine fabrics To the thus-gone Secret Delight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་གྲགས་པ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱིག་གི་འོད་ཟེར་ལ། །བླ་རེ་སྤོས་ཅན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnayaśas, when a prince, Offered fragrant canopies To the thus-gone Radiant Treasure And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་གསལ་བ་རིན་ཆེན་འཚོང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་འབྱུང་གནས་དེ་ལ་ནི། །རིན་པོ་ཆེ་དག་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇiprabhāsa, when a jewel merchant, Scattered a handful of jewels Before the thus-gone Source of Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་པ་མཐའ་ཡས་དེད་དཔོན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་མེ་ཏོག་དཔལ་དེ་ལ། །ན་བཟའ་བླ་རེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anantayaśas, when the son of a captain, Offered clothing and canopies To the well-gone Flower Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་དོན་ཡོད་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕྱག་ལྡན་དེ་ལ་ནི། །མུ་ཏིག་དམར་པོ་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amogharaśmi, when a seafaring merchant, Scattered a handful of red pearls Before the thus-gone Hands of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་དྲང་སྲོང་དྲང་སྲོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་མ་ལ། །ལོ་མ་དག་གི་གདུགས་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ṛṣideva, when a sage, Offered a parasol made of leaves To the thus-gone Dharma Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་འོད་ཟེར་ལ། །གླིང་བཞི་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendra, when a universal monarch, Offered the four continents To the thus-gone Universal Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགེ་འདུན་བརྟན་པ་མཐའ་འཁོབ་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་ཅན་དེ་ལ་ནི། །མེ་ཏོག་སྟོང་སྙེད་བཀྲམ་པའི་འཆག་ས་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhasaṅgha, when the king of a barbarian realm, Offered a monastic walkway covered with thousands of flowers To the thus-gone Possessor of the Brahmā Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཕྱོགས་བཟང་གསེར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་ལ། །གསེར་གྱི་གླེགས་མ་བཀྲམ་པའི་འཆག་ས་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Supakṣa, when a gold merchant, Offered a monastic walkway covered with gold To the thus-gone Great Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཏོག་ནི་གསེར་མགར་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པའི་ཉི་མ་ལ། །མར་མེ་བཟང་པོ་བཤམས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ketu, when a young goldsmith, Prepared fine butter lamps as an offering Before the thus-gone Sun of Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་མེ་ཏོག་རྩྭ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་བརྟན་པོ་ཡི། །འཆག་ས་རྩྭ་ཡིས་ཁེབས་པར་བཀྲམ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumarāṣṭra, when a straw seller, Covered a monastic walkway with straw Before the thus-gone Steadfast Diligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་བླ་གྲོས་ཚོང་དུས་པ་ཡི་ཚེ། །ཚོང་དུས་བར་སྲང་དག་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བློ་ཡི་འོད་ལྡན་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmamati, when a market salesman, Swept the lanes of the market Before the thus-gone Possessing the Light of Intelligence, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རླུང་ཤུགས་ལྟར་གཤེགས་དྷིང་ཏ་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྲགས་པ་དེ་ལ་ནི། །བསིལ་ཡབ་དག་གིས་གཡབ་པ་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anilavegagāmin, when a young dhing ta, Offered cooling fanning To the thus-gone Famed QualitiesAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་བསམས་གྲགས་པ་གཏར་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པའི་བློ་དེ་ལ། །ནོར་བུ་སྐར་འོད་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucittayaśas, when a surgeon Offered a starlight jewel To the thus-gone Excellent Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྣང་ལྡན་རྒྱལ་པོའི་ཕོ་ཉའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་དཔག་མེད་ལ། །ལན་གསུམ་བསྐོར་བ་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dyutimat, when a royal messenger, Three times circumambulated The thus-gone Immeasurable Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཚོགས་འཁོར་སྒྱུར་བློན་མཆོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་མཆེ་བ་ལ། །གསེར་དང་བྱི་རུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Marutskandha, when a universal monarch’s chief minister, Offered gold and coral To the thus-gone Lion Fangs And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་བསྲུངས་པ་འདྲོན་པོའི་ཚེ། །ལམ་སྲང་དག་ཏུ་རྡོ་སྟེགས་བཙུགས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་མཐུ་རྩལ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇagupta, when a traveler, Paved the roads with tiles Before the thus-gone Powerful Merit, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་གྱི་བློ་གྲོས་ལྔ་མངོན་ཤེས་པ་པོ། །བྲམ་ཟེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ལྷ་མཆོག་གི། །ཞབས་ལ་མགོ་བོ་དག་གི་ཕྱག་དག་འཚལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arthamati, when a brahmin who possessed the five superknowledges, Bowed his head to the feet Of the thus-gone Supreme Deity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསྙེངས་མེད་ཆུ་རྐ་སྲུང་བའི་ཚེ། །ཉིན་ཞག་བདུན་དུ་བྱམས་པ་བསྒོམས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་གནས་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhaya, when the guard of an irrigation channel, Cultivated love for seven days Before the thus-gone Abiding by Seeing, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲོགས་བརྟན་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མཆོད་རྟེན་ལ། །ཁང་བརྩེགས་མོན་དར་དག་གིས་བཀབ་པ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthitamitra, when a clothing merchant, Offered multistoried mansions enveloped in kauśeya silk To the thus-gone Divine Stūpa And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་གནས་མཚུངས་པ་དགེ་སློང་ཚེ། །དམ་ཆོས་ཡོངས་སུ་གཟུང་ཕྱིར་སྤྲོ་བསྐྱེད་ནས། །དེ་བཞིན་གཤེགས་པ་གློག་གི་འོད་ཟེར་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prabhāsthita­kalpa, when a monk, Developed enthusiasm for protecting the sacred Dharma Before the thus-gone Flashing Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་ཞབས་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱལ་བར་དགྱེས་དེ་ལ། །མེ་ཏོག་ཨུད་པལ་ཆང་པ་གང་གཏོར་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇicaraṇa, when the son of a merchant, Scattered a rain of utpala flowers Before the thus-gone Delighting in Victory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐར་པའི་གཟི་བརྗིད་གྲོང་དཔོན་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་རྒྱལ་མཚན་དེ་ལ་ནི། །བསོད་སྙོམས་དང་པོ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mokṣatejas, when the daughter of the head of a city, Offered the first alms To the thus-gone Majestic Banner And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ངོས་བཟངས་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་དེ་ལ། །ཞུན་མར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sundarapārśva, when a cattle herder, Offered refined butter To the thus-gone Flower Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་བཟངས་ཕྱུག་པོའི་བུ་ཚེ་སངས་རྒྱས་ཀྱི། །དགེ་སློང་ཁ་ཏོན་འདོན་པར་བཟའ་བ་བྱིན་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་མཆོག་མ་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Subuddhi, when the son of a wealthy man, Offered food to monks of the buddha who chanted Before the thus-gone Supreme Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀུན་གཟིགས་རབ་བྱུང་ཞག་བདུན་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་ངད་ལྡན་བཅོམ་ལྡན་གྱིས། །ལེགས་པར་གསུངས་ལ་རྗེས་སུ་ཡི་རང་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samantadarśin, when a monk who had gone forth seven days earlier, Offered rejoicing in fine statements of the blessed one And so, before the thus-gone Endowed with Incense Fragrance, First gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་མཆོག་ནི་དགེ་སློང་ཚེ། །ཏིང་འཛིན་འདི་ལ་ཡི་རང་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐུ་རྩལ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānavara, when a monk, Rejoiced in this absorption Before the thus-gone Powerful Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་གནས་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཁྱད་པར་ལ། །ཡན་ལག་ལྔ་ལྡན་སིལ་སྙན་དག་གིས་མཆོད། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmavāsa, when a prince, Offered music endowed with the five features To the thus-gone Distinguished Intelligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་གསུང་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་དྲང་སྲོང་གསལ་དེ་ལ། །ལྷུང་བཟེད་འོ་མས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyaruta, when a householder, Filled an alms bowl with milk and offered it To the thus-gone Clear Sage And in doing so first gave rise to the mind of awakening.
